app/views/users/_deck_select.html.erb

  window.cacheUsersAndSetupSearch = function () {
    $.ajax({
      url: "/users",
      type: "GET",
      success: function (usersData) {
        window.cachedUsers = usersData;
        //Only allow search bar to appear after caching AJAX response
        $("div.deck-search-bar-container")
          .html("<input type='text' class='deck-search-bar'><br>");
        $searchEl = $("div.deck-search-div");
        $input = this.$searchEl.find("input.deck-search-bar");
        $results = this.$searchEl.find("ul.deck-search-results");
        //**************************************************************
        //Clarify with TA why this syntax (why not just 'document'), and why does it break when
        //second arg is a class? Also, how to make this cleaner (jQuery plugin, but
        //ONLY for this page to avoid collisions, or AJAX thru Backbone instead)?
        //**************************************************************
        $(document.body).on("input","input", function () {
          window.deckSearch();
        });
      }.bind(this)
    })
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]