app/controllers/decks_controller.rb

  def index
    @deck_owner = User.find(params[:user_id].to_i)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]

  def create
    @deck = Deck.new(deck_params)
    @deck.owner_id = current_user.id.to_i
    if @deck.save
---
INSERT INTO "decks" ("created_at", "owner_id", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 10 Mar 2015 21:16:51 UTC +00:00], ["owner_id", 4], ["title", "blah"], ["updated_at", Tue, 10 Mar 2015 21:16:51 UTC +00:00]]

  def edit
    @deck = Deck.find(params[:id])
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT 1  [["id", "3"]]

  def update
    @deck = Deck.find(params[:id])
    if @deck.update(deck_params)
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "decks" SET "is_private" = $1, "updated_at" = $2 WHERE "decks"."id" = 1  [["is_private", false], ["updated_at", Wed, 11 Mar 2015 01:35:27 UTC +00:00]]

  def destroy
    @deck = Deck.find(params[:id])
    @deck.destroy
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "decks" WHERE "decks"."id" = $1  [["id", 3]]