app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if params[:name_query]
      @users = User.where("username ~* ?", params[:name_query])
      render json: @users.to_json(:only => [:id, :username])
    else
      @users = User.all

INSERT INTO "users" ("created_at", "email", "password_digest", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.ensure_session_token
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]
UPDATE "users" SET "username" = $1, "email" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = 4  [["username", "Bobby"], ["email", "glob@bob.com"], ["password_digest", "$2a$10$KH7eqVeLQIB.UQS6BZrH2eryxyFdcO3Wvv5HyTiJLZzT8qxgcJfwq"], ["updated_at", Tue, 10 Mar 2015 18:41:03 UTC +00:00]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)